#参考  用户说明书.pdf  65页 7.1故障分类信息对象
ERROR_DICT = {
    0x305A: {  # 电压故障
        0: "直流过压故障",     # BIT0
        1: "直流欠压故障",     # BIT1
        2: "控制电压异常",     # BIT2
        # 其余位保留
    },
    0x305B: {  # 驱动器故障
        0: "MOS 过流",
        1: "相电流过流",
        2: "电机过载",
        3: "驱动器过热",
        4: "动力线断开",
        # 其余位保留
    },
    0x305C: {  # 系统故障
        0: "存储器故障",
        1: "系统初始化异常",
        2: "电流传感器故障",
        # 其余位保留
    },
    0x305D: {  # 编码器故障
        0: "编码器报警通讯超时",
        1: "编码器报警输出报警",
        2: "编码器电池掉电故障",
        3: "编码器数据校验错误",
        # 其余位保留
    },
    0x305E: {  # 软件故障
        # 全部保留
    },
    0x305F: {  # 速度控制故障
        0: "过速故障",
        1: "速度超差故障",
        # 其余位保留
    },
    0x3060: {  # 位置控制故障
        0: "位置正向超程故障",
        1: "位置反向超程故障",
        2: "位置超差故障",
        3: "位置指令超差"
        # 其余位保留
    },
    0x3061: {  # 通信故障
        0: "通信总线中断",
        # 其余位保留/根据手册添加
    },
    0x3062: {  # 应用故障
        0: "编码器初始角对齐失败",
        1: "电机相序测试失败",
        2: "电机电感测试失败",
        3: "回原点失败",
        # 其余位保留/根据手册添加
    }
}