# 定义错误码字典

initial_error_codes = {   #相关函数initial(generation,z_trail)
    0:"机械臂不在线",
    1:"初始化成功",
    2:"generation 参数错误",
    3:"机械臂当前位置不在限定范围,可以使用joint_home()函数使关节强制回零",
    12:"z_travel 传参错误",
    101:"传入参数 NOT A NUMBER",
    105:"存在某一个关节失效"
}

joint_home_error_codes = {   #相关函数joint_home()
    0:"未连接",
    1:"调用正常",
    2:"传入参数错误",
    3:"机械臂正在初始化"   
}

inverse_kinematics_error_message = {  #自己调用创建
    0: "逆解运算成功",
    1: "未能找到满足精度的解,可考虑增大迭代次数和增加学习率",
    2: "某关节角度变化过大°",
    3: "雅可比矩阵伪逆计算失败"

}

clear_hard_emergency_stop_error_codes = {   #相关函数clear_hard_emergency_stop()
    -1:"该机型不支持",
    0:"未处于急停状态",
    1:"解除成功",
    2:"解除超时",
    3:"未连接",
    4:"没有急停功能",
    5:"正处于急停状态"
}

move_error_codes = {   #相关函数new_movej_xyz_lr(), xyz_move()
    0: "正在执行其他指令，本次指令无效",
    1: "本次指令生效，机械臂开始运动",
    2: "设置速度小于等于零",
    3: "未初始化",
    4: "目标点无法到达",
    5: "方向参数错误",
    6: "伺服未开启",
    7: "无法以设定手系到达目标点位/该姿态无法完成直线运动",
    11: "手机端在控制",
    99: "急停中",
    101: "传入参数 NOT A NUMBER",
    102: "发生碰撞，本次指令无效",
    103: "轴发生复位，需要重新初始化，本次指令无效"
}


movej_error_codes = {   #相关函数 new_movej_angle()
    0: "正在执行其他指令，本次指令无效",
    1: "本次指令生效，机械臂开始运动",
    2: "设置速度小于等于零",
    3: "未初始化",
    4: "目标点无法到达",
    5: "方向参数错误",
    6: "伺服未开启",
    11: "手机端在控制",
    99: "急停中",
    101: "传入参数 NOT A NUMBER",
    102: "发生碰撞，本次指令无效",
    103: "轴发生复位，需要重新初始化，本次指令无效"
}

single_joint_move_code = { #相关函数single_joint_move(self, joint_id, angle, speed)
    0: "正在执行其他指令，本次指令无效",
    1: "本次指令生效，机械臂开始运动",
    2: "设置速度小于等于零",
    3: "未初始化",
    5: "轴号参数错误",
    6: "伺服未开启",
    11: "手机端在控制",
    101: "传入参数 NOT A NUMBER",
    102: "发生碰撞，本次指令无效",
    103: "轴发生复位，需要重新初始化，本次指令无效"
}

joint_error_codes = {   #相关函数get_joint_state()
    0: "轴发生复位，需要重新初始化 ",
    1: "关节正常",
    2: "传入参数超范围",
    3: "未初始化",
    4: "轴状态获取失败",
    5: "发生碰撞",
    6: "处于拖动模式",
    7: "关节缺轴/失效",
    8: "编码器错误",
    9: "电机堵转/过电流保护",
    10: "过压保护",
    11: "手臂收到PC发送的错误数据",
    12: "手臂主控与驱动通讯异常",
    21: "MOSntc开路",
    22: "MOSntc短路",
    23: "电机ntc开路",
    24: "电机ntc短路",
    25: "MOSntc温度过高",
    26: "MOSntc温度过低",
    27: "电机ntc温度过高",
    28: "电机ntc温度过低"
}
#机器人碰撞状态
collision_error = {   #相关函数is_collision()
    False: "未发生碰撞",
    True: "发生碰撞",
}
#机器人连接状态
connect_error = {   #相关函数is_connect()
    False: "机械臂不在线",
    True: "机械臂在线",
}

#4150,4160新机型支持,不知道支不支持
emergency_stop_error_codes = {   #相关函数get_hard_emergency_stop_state()
    -1: "该机型不支持",
    0: "未处于急停状态",
    1: "处于急停状态",
    3: "未连接",
    4: "没有急停功能",
}